<?

#Делать транслит

function encodestring($st)
{
  // Сначала заменяем "односимвольные" фонемы.
  $st=strtr($st,"абвгдеёзийклмнопрстуфхъыэ_",
  "abvgdeeziyklmnoprstufh'iei");
  $st=strtr($st,"АБВГДЕЁЗИЙКЛМНОПРСТУФХЪЫЭ_",
  "abvgdeeziyklmnoprstufh'iei");	
  // Затем - "многосимвольные".
  $st=strtr($st, 
				  array(
					  "ж"=>"zh", "ц"=>"ts", "ч"=>"ch", "ш"=>"sh", 
					  "щ"=>"shch","ь"=>"", "ю"=>"yu", "я"=>"ya",
					  "Ж"=>"ZH", "Ц"=>"TS", "Ч"=>"CH", "Ш"=>"SH", 
					  "Щ"=>"SHCH","Ь"=>"", "Ю"=>"YU", "Я"=>"YA",
					  "ї"=>"i", "Ї"=>"Yi", "є"=>"ie", "Є"=>"Ye", " "=>"_", "."=>"", ","=>"", "("=>"", ")"=>"", "/"=>"", "-"=>"_", "!"=>"", "?"=>"", "+"=>"", "»"=>"", "«"=>"", "'"=>"", '"'=>'', "@"=>"",
					  "#"=>"", "$"=>"", "%"=>"", "&"=>"", "*"=>"", "^"=>"", ":"=>"", ";"=>"", "?"=>"", "~"=>"", "`"=>"", "^"=>"", "["=>"", "]"=>"", "|"=>"", "="=>""
					  )
		   );
  
  $st = str_replace('__','_',$st);
  $st = str_replace('__','_',$st);
  $st = str_replace('__','_',$st);
  
  return $st;
 
}




?>